# Análisis de Datos del Titanic
Maestría Ciencias de Información y las Comunicaciones - Materia: Big Data.

Por: David Alonso Rueda Rodríguez - 20181395007 (daruedar@correo.udistrital.edu.co)

Tema: Preprocesamiento de datos.

#### Objetivo de la actividad:

Aprender conceptos básicos de procesamiento de datos utilizando pandas

#### Fuente de datos:

Esta actividad está basada en la descripción realizada por: Amitabha Dey, y su entrada en el Blog Data Driven Investor.

Link: https://medium.com/datadriveninvestor/data-preprocessing-for-machine-learning-188e9eef1d2c

#### Temas trabajados

A continuación, listado de actividades trabajadas en el pre-procesamiento de datos:
    
##### Pre-procesamiento
    1  Cargar Librerías
    2. Importar datos con pandas
    3. Revisión de datos cargados
    4. Preparación del grupo de datos
    5. Codificación de variables cualitattivas
    6. Procesamiento adicional con otras librerías
##### Análisis Estadístico de Datos
    1. Revisión datos numéricos
    2. Revisión datos categóricos
    
#### Listado de versiones

1.2.0 Se agregan títulos con etapas del trabajo desarrollado
1.1.0 Se actualizan datos de presentación de la actividad, objetivos y control de versiones.
1.0.0 Preparación del documento siguiendo documento de referencia.

#### Fuente de repositorio de datos:

Los datos trabajados se descargaron desde la plataforma Kaggle, repositorio Titanic.

Link: https://www.kaggle.com/c/titanic/data

## Pre-procesamiento
### 1. Cargar Librerías

Este proyecto utilizará las librerías pandas, numpy y matplotlib.

In [1]:
# importat librerías de interés
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
% matplotlib inline

### 2. Importar datos con pandas
Se importará el archivo de datos descargado desde el repositorio de kaggle, en este caso se cargarán todos los datos para iniciar el pre-procesamiento con pandas.

In [2]:
# Importar archivo de entrenamiento
ent = pd.read_csv('train.csv')

### 3. Revisión de datos cargados
Presentación de los datos cargados a un DataFrame de pandas

In [3]:
# Número de filas y columnas importadas
print('Número de filas cargadas: {} \nNúmero de Columnas cargadas: {}' .format(ent.shape[0], ent.shape[1]))
# Mostrar primeros 5 datos
print('\n----\nDatos en el DataFrame "ent":')
ent.head(5)

Número de filas cargadas: 891
Número de Columnas cargadas: 12

----
Datos en el DataFrame "ent":

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
# Retorna los encabezados del panel de datos cargado
ent.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [5]:
# Número de datos nulos por columna
ent.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

### 4. Preparación del grupo de datos

In [6]:
# Revisión de campos disponibles y ejemplo de datos
ent.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [7]:
# Número de filas y columnas
print('Número de filas y Columnas cargadas: {}' .format(ent.shape))
ent.columns

Número de filas y Columnas cargadas: (891, 12)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

Se observa que se han restado las 2 columnas solicitadas

In [8]:
# Revisión de elementos cargados
ent.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [9]:
# Definición de Función para asignación de código de cabina
def asignarCamarote(cabin_code):
    if pd.isnull(cabin_code):
        category = 'Unknown'
    else:
        category = cabin_code[0]
    return category

In [10]:
# Asignación del dato de la cabina
Deck = np.array([asignarCamarote(cabin) for cabin in ent['Cabin'].values])
ent = ent.assign(Deck = Deck)

In [11]:
# Revisión de campo creado y asignado
ent.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Deck
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Unknown
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Unknown

In [12]:
# Creación de un nuevo campo derivado para encontrar el tamaño de las familias
ent['FamilySize'] = ent['SibSp'] + ent['Parch'] + 1

In [13]:
# Revisión de campo creado y asignado
ent.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Deck,FamilySize
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Unknown,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,C,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Unknown,1

In [14]:
# Creación del campo 'Title' y asignación del 'Title' (título en español)
ent['Title'] = ent.Name.str.extract('([A-Za-z]+)\.', expand=False)
# Imprimir ejemplo del elemento de interés
ent.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Deck,FamilySize,Title
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Unknown,2,Mr
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,C,2,Mrs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Unknown,1,Miss

In [15]:
# Ajustar las categorías del campo 'Title', utilizando la función reemplazar.
ent['Title'] = ent['Title'].replace(['Dr', 'Rev', 'Col', 'Major', 'Countess', 'Sir', 'Jonkheer', 'Lady', 'Capt', 'Don'], 'Others')
ent['Title'] = ent['Title'].replace('Ms', 'Miss')
ent['Title'] = ent['Title'].replace('Mme', 'Mrs')
ent['Title'] = ent['Title'].replace('Mlle', 'Miss')

In [16]:
ent.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Deck,FamilySize,Title
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Unknown,2,Mr
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,C,2,Mrs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Unknown,1,Miss

In [17]:
# En esta ocasión se eliminará la el campo 'Cabin'
ent.drop(['Cabin','Name', 'PassengerId', 'Ticket'], 1, inplace=True)

In [18]:
# Revisión de los elementos
ent.head(3)

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Deck,FamilySize,Title
0,0,3,male,22.0,1,0,7.2500,S,Unknown,2,Mr
1,1,1,female,38.0,1,0,71.2833,C,C,2,Mrs
2,1,3,female,26.0,0,0,7.9250,S,Unknown,1,Miss

In [19]:
print('Número de filas y Columnas cargadas: {}' .format(ent.shape))

Número de filas y Columnas cargadas: (891, 11)

In [20]:
# Manejo de campos sin datos
# ¿Cuántos pasajeros abordaron en cada uno de los sitios de embarque?
ent['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [21]:
# Número de datos nulos
ent['Embarked'].isnull().sum()

2

In [22]:
# Asignar valores a los elementos nulos
## Se asumirá que los pasajeros con datos sin asignación embarcaron en la categoría más numerosa
comun = 'S'
# Asignación de valores vacíos
ent['Embarked'] = ent['Embarked'].fillna(comun)
ent['Embarked'].isnull().sum()

0

In [23]:
# Cantidad de campos sin datos de edad asignados
ent['Age'].isnull().sum()

177

In [24]:
# Asignar valores de edad
means = ent.groupby('Title')['Age'].mean()
#
title_list = ['Master','Miss','Mr','Mrs','Others']
def reemplazar_edadperdidas(means, dframe, title_list):
    for title in title_list:
        temp = dframe['Title'] == title 
        dframe.loc[temp, 'Age'] = dframe.loc[temp, 'Age'].fillna(means[title]) 
# Asignación de valores para edades sin datos       
reemplazar_edadperdidas(means, ent, title_list)

In [25]:
# Cantidad de campos sin datos de edad asignados, luego de correr función de asignación
ent['Age'].isnull().sum()

0

### 5. Codificación de variables cualitativas

In [26]:
# En primera instancia se revisará cuantos elementos deben ser transformados del campo 'Embarked'
ent['Embarked'].value_counts()

S    646
C    168
Q     77
Name: Embarked, dtype: int64

In [27]:
# El cambio se hará utilizando la función map
#
ent['Embarked'] = ent['Embarked'].map({'C':0, 'Q':1, 'S':2})
ent['Sex'] = ent['Sex'].map({'male':0, 'female':1})
ent['Title'] = ent['Title'].map({'Master':0,'Miss':1,'Mr':2,'Mrs':3,'Others':4})

In [28]:
# Presentación de los datos procesados hasta el momento
ent.head(5)

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Deck,FamilySize,Title
0,0,3,0,22.0,1,0,7.2500,2,Unknown,2,2
1,1,1,1,38.0,1,0,71.2833,0,C,2,3
2,1,3,1,26.0,0,0,7.9250,2,Unknown,1,1
3,1,1,1,35.0,1,0,53.1000,2,C,2,3
4,0,3,0,35.0,0,0,8.0500,2,Unknown,1,2

### 6. Procesamiento adicional con otras librerías
En el listado anterior únicamente falta por traducir el campo 'Deck', para esto se utilizará un método alternativo.

In [29]:
from sklearn import preprocessing as ppg
le = ppg.LabelEncoder()
ent['Deck'] = le.fit_transform(ent['Deck'])
ent.head(15)

ModuleNotFoundError: No module named 'sklearn'

## Análisis Estadístico de Datos
### 1. Revisión datos numéricos

In [ ]:
ent['Age'].sum()

### 2. Revisión datos categóricos

In [ ]:
ent['Deck'].sum()